# Pandas

In [1]:
import pandas as pd

In [4]:
!ls data.csv    # !dir op windows

data.csv

In [6]:
filename = r'C:\users\peter\documents\data.csv'
filename = 'data.csv'

In [8]:
with open(filename) as f:
    data = f.read()

print(data)

ï»¿Naam;Woonplaats;Leeftijd
Peter;Lhee;65
Emma;Utrecht;34
Stijn;Utrecht;36
Floor;Amsterdam;37
Mo;Utrecht;35
Martijn;Utrecht;36
Melanie;Hilversum;34
Melisa;Amsterdam;36
Nenad;Utrecht;29
Martijn;Soest;35
Luuk;Utrecht;39
Midas;Utrecht;32
Tijmen;Utrecht;35

In [16]:
df = pd.read_csv(filename, delimiter=';')
df

       Naam Woonplaats  Leeftijd
0     Peter       Lhee        65
1      Emma    Utrecht        34
2     Stijn    Utrecht        36
3     Floor  Amsterdam        37
4        Mo    Utrecht        35
5   Martijn    Utrecht        36
6   Melanie  Hilversum        34
7    Melisa  Amsterdam        36
8     Nenad    Utrecht        29
9   Martijn      Soest        35
10     Luuk    Utrecht        39
11    Midas    Utrecht        32
12   Tijmen    Utrecht        35

In [17]:
df['Naam']

0       Peter
1        Emma
2       Stijn
3       Floor
4          Mo
5     Martijn
6     Melanie
7      Melisa
8       Nenad
9     Martijn
10       Luuk
11      Midas
12     Tijmen
Name: Naam, dtype: object

In [18]:
df[['Woonplaats', 'Naam']]

   Woonplaats     Naam
0        Lhee    Peter
1     Utrecht     Emma
2     Utrecht    Stijn
3   Amsterdam    Floor
4     Utrecht       Mo
5     Utrecht  Martijn
6   Hilversum  Melanie
7   Amsterdam   Melisa
8     Utrecht    Nenad
9       Soest  Martijn
10    Utrecht     Luuk
11    Utrecht    Midas
12    Utrecht   Tijmen

In [21]:
df.sort_values(['Woonplaats','Naam'])

       Naam Woonplaats  Leeftijd
3     Floor  Amsterdam        37
7    Melisa  Amsterdam        36
6   Melanie  Hilversum        34
0     Peter       Lhee        65
9   Martijn      Soest        35
1      Emma    Utrecht        34
10     Luuk    Utrecht        39
5   Martijn    Utrecht        36
11    Midas    Utrecht        32
4        Mo    Utrecht        35
8     Nenad    Utrecht        29
2     Stijn    Utrecht        36
12   Tijmen    Utrecht        35

In [23]:
df['Woonplaats'] == 'Utrecht'

0     False
1      True
2      True
3     False
4      True
5      True
6     False
7     False
8      True
9     False
10     True
11     True
12     True
Name: Woonplaats, dtype: bool

In [80]:
selection = df[df['Woonplaats'] == 'Utrecht'].sort_values('Naam', ascending=False)
selection

   Woonplaats     Naam  Leeftijd
12    Utrecht   Tijmen        35
2     Utrecht    Stijn        36
8     Utrecht    Nenad        29
4     Utrecht       Mo        35
11    Utrecht    Midas        32
5     Utrecht  Martijn        36
10    Utrecht     Luuk        39
1     Utrecht     Emma        34

In [33]:
selection.to_csv('selection.csv')

In [34]:
!ls selection.csv

selection.csv

In [35]:
with open('selection.csv') as f:
    data = f.read()

print(data)

,Naam,Woonplaats,Leeftijd
1,Emma,Utrecht,34
10,Luuk,Utrecht,39
5,Martijn,Utrecht,36
11,Midas,Utrecht,32
4,Mo,Utrecht,35
8,Nenad,Utrecht,29
2,Stijn,Utrecht,36
12,Tijmen,Utrecht,35

In [36]:
df.ndim

2

In [37]:
df.shape

(13, 3)

In [38]:
df.dtypes

Naam          object
Woonplaats    object
Leeftijd       int64
dtype: object

In [40]:
list(df.columns)

['Naam', 'Woonplaats', 'Leeftijd']

In [49]:
df.columns = [c.capitalize() for c in df.columns]

In [52]:
df = df[['Woonplaats', 'Naam', 'Leeftijd']]

In [53]:
df

   Woonplaats     Naam  Leeftijd
0        Lhee    Peter        65
1     Utrecht     Emma        34
2     Utrecht    Stijn        36
3   Amsterdam    Floor        37
4     Utrecht       Mo        35
5     Utrecht  Martijn        36
6   Hilversum  Melanie        34
7   Amsterdam   Melisa        36
8     Utrecht    Nenad        29
9       Soest  Martijn        35
10    Utrecht     Luuk        39
11    Utrecht    Midas        32
12    Utrecht   Tijmen        35

In [54]:
df.size

39

In [55]:
df.index

RangeIndex(start=0, stop=13, step=1)

In [56]:
df.axes

[RangeIndex(start=0, stop=13, step=1),
 Index(['Woonplaats', 'Naam', 'Leeftijd'], dtype='object')]

In [57]:
df.count()

Woonplaats    13
Naam          13
Leeftijd      13
dtype: int64

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Woonplaats  13 non-null     object
 1   Naam        13 non-null     object
 2   Leeftijd    13 non-null     int64
dtypes: int64(1), object(2)
memory usage: 440.0+ bytes

In [60]:
df.describe()

        Leeftijd
count  13.000000
mean   37.153846
std     8.706761
min    29.000000
25%    34.000000
50%    35.000000
75%    36.000000
max    65.000000

In [75]:
df['Naam'] = df['Naam'].astype('string')
df['Woonplaats'] = df['Woonplaats'].astype('category')

In [78]:
df['Woonplaats']

0          Lhee
1       Utrecht
2       Utrecht
3     Amsterdam
4       Utrecht
5       Utrecht
6     Hilversum
7     Amsterdam
8       Utrecht
9         Soest
10      Utrecht
11      Utrecht
12      Utrecht
Name: Woonplaats, dtype: category
Categories (5, object): ['Amsterdam', 'Hilversum', 'Lhee', 'Soest', 'Utrecht']

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Woonplaats  13 non-null     category
 1   Naam        13 non-null     string
 2   Leeftijd    13 non-null     int64
dtypes: category(1), int64(1), string(1)
memory usage: 561.0 bytes